var  uploadedDataURL="js/guangdong.json";
$(function() {
  var myChart = echarts.init(document.getElementById('echarts'));
  $.getJSON(uploadedDataURL, function (geoJson) {
    echarts.registerMap('xiangxi', geoJson);
    myChart.hideLoading();
    var geoCoordMap = {
      '广州市':[113.264360,23.129080],
      // '越秀区':[113.266800,23.129010],
      // '荔湾区':[113.244280,23.125860],
      // '海珠区':[113.317200,23.083310],
      // '天河区':[113.361990,23.124630],
      // '白云区':[113.273238,23.157032],
      // '黄埔区':[113.480670,23.181390],
      // '花都区':[113.220260,23.403910],
      // '番禺区':[113.384240,22.937720],
      // '南沙区':[113.524970,22.801690],
      // '增城区':[113.810900,23.260930],
      // '从化区':[113.586460,23.548350],
      '深圳市':[114.059560,22.542860],
      // '福田区':[114.054540,22.522910],
      // '罗湖区':[114.131660,22.548360],
      // '南山区':[113.930690,22.533250],
      // '盐田区':[114.236790,22.557000],
      // '宝安区':[113.883080,22.553290],
      // '龙岗区':[114.247790,22.719910],
      // '龙华区':[114.044620,22.696694],
      // '坪山区':[114.346320,22.690840],
      '珠海市':[113.576680,22.270730],
     //  '香洲区':[113.543202,22.265939],
     //  '斗门区':[113.296580,22.209030],
     //  ',金湾区':[113.364200,22.145890],
     //  '汕头市':[116.682210,23.353500],
     //  '金平区':[116.705400,23.365250],
     //  '龙湖区':[116.716770,23.372460],
     // '濠江区':[116.726640,23.285920],
     //  '潮南区':[116.433100,23.250290],
     //  '潮阳区':[116.601570,23.264890]
     //  '澄海区':[116.756080,23.466130]
     //  '南澳县':[117.023480,23.421780],
      '佛山市':[113.121920,23.021850],
      // '禅城区':[113.122490,23.009440],
      // '高明区':[112.892620,22.900260],
      // '三水区':[112.896720,23.155850],
      // '南海区':[,113.142780,23.028820],
      // '顺德区':[,113.293210,22.805360],
      '韶关市':[113.597230,24.810390],
      // 韶关市,浈江区,113.610950,24.804460
      // 韶关市,武江区,113.587710,24.792680
      // 韶关市,曲江区,113.604580,24.682600
      // 韶关市,乐昌市,113.347460,25.130140
      // 韶关市,南雄市,114.310840,25.119620
      // 韶关市,始兴县,114.062060,24.952690
      // 韶关市,仁化县,113.749180,25.085660
      // 韶关市,翁源县,114.130330,24.350200
      // 韶关市,新丰县,114.206890,24.059590
      // 韶关市,乳源瑶族自治县,113.275960,24.775910
      '湛江市':[110.358940,21.271340],
      // 湛江市,赤坎区,110.365340,21.266240
      // 湛江市,霞山区,110.398210,21.191690
      // 湛江市,坡头区,110.455500,21.244750
      // 湛江市,麻章区,110.334270,21.263310
      // 湛江市,廉江市,110.286250,21.609620
      // 湛江市,吴川市,110.778240,21.441820
      // 湛江市,雷州市,110.096510,20.914440
      // 湛江市,遂溪县,110.250060,21.377080
      // 湛江市,徐闻县,110.175020,20.326520
      '肇庆市':[112.465280,23.046900],
      // 肇庆市,端州区,112.484610,23.051960
      // 肇庆市,鼎湖区,112.567060,23.158150
      // 肇庆市,高要区,112.458390,23.025810
      // 肇庆市,四会市,112.734040,23.327430
      // 肇庆市,广宁县,112.441120,23.634930
      // 肇庆市,怀集县,112.184540,23.911880
      // 肇庆市,封开县,111.511960,23.424480
      // 肇庆市,德庆县,111.785590,23.143760
      '江门市':[113.081610,22.578650],
      // 江门市,江海区,113.111030,22.560280
      // 江门市,蓬江区,113.078450,22.595140
      // 江门市,新会区,113.032310,22.458770
      // 江门市,台山市,112.793900,22.251560
      // 江门市,鹤山市,112.964360,22.765300
      // 江门市,开平市,112.698510,22.376380
      // 江门市,恩平市,112.305320,22.182940
      '茂名市':[110.925230,21.663290],
      // 茂名市,茂南区,110.918790,21.641090
      // 茂名市,电白区,111.016360,21.514280
      // 茂名市,高州市,110.853380,21.918120
      // 茂名市,化州市,110.639540,21.663970
      // 茂名市,信宜市,110.947100,22.354290
      '惠州市':[114.416790,23.110750],
      // 惠州市,惠城区,114.382730,23.083830
      // 惠州市,惠阳区,114.456460,22.788510
      // 惠州市,博罗县,114.289730,23.173150
      // 惠州市,龙门县,114.254860,23.727630
      // 惠州市,惠东县,114.719990,22.984860
      '梅州市':[116.122640,24.288440],
      // 梅州市,梅江区,116.116990,24.309960
      // 梅州市,梅县区,116.082450,24.265390
      // 梅州市,兴宁市,115.731190,24.136500
      // 梅州市,大埔县,116.695200,24.347920
      // 梅州市,丰顺县,116.182250,23.739450
      // 梅州市,五华县,115.776090,23.932540
      // 梅州市,平远县,115.891120,24.566320
      // 梅州市,蕉岭县,116.171230,24.658610
      '汕尾市':[115.375140,22.785660],
      // 汕尾市,汕城区,115.375140,22.785660
      // 汕尾市,陆丰市,115.644620,22.945110
      // 汕尾市,海丰县,115.323410,22.966570
      // 汕尾市,陆河县,115.659960,23.301480
      '河源市':[114.700650,23.743650],
      // 河源市,源城区,114.702460,23.734170
      // 河源市,龙川县,115.259840,24.100140
      // 河源市,连平县,114.488650,24.369560
      // 河源市,东源县,114.746250,23.788560
      // 河源市,和平县,114.938720,24.442010
      // 河源市,紫金县,115.183980,23.635320
      '阳江市':[111.982560,21.858290],
      // 阳江市,江城区,111.955160,21.861820
      // 阳江市,阳东区,112.006700,21.868290
      // 阳江市,阳春市,111.791530,22.170300
      // 阳江市,阳西县,111.617910,21.752290
      '清远市':[113.056150,23.682010],
      // 清远市,清城区,113.062690,23.697950
      // 清远市,清新区,113.016580,23.734740
      // 清远市,英德市,113.415050,24.185720
      // 清远市,连州市,112.376770,24.779980
      // 清远市,佛冈县,113.531720,23.879210
      // 清远市,阳山县,112.641320,24.465000
      // 清远市,连山壮族瑶族自治县,112.093480,24.570360
      // 清远市,连南瑶族自治县,112.286980,24.725400
      '东莞市':[113.751790,23.020670],
      '中山市':[113.392600,22.515950],
      '潮州市':[116.622960,23.656700],
      // 潮州市,湘桥区,116.628340,23.674410
      // 潮州市,潮安区,116.678090,23.462440
      // 潮州市,饶平县,117.003900,23.664120
      '揭阳市':[116.372710,23.549720],
      // 揭阳市,榕城区,116.366920,23.524860
      // 揭阳市,揭东区,116.412110,23.566060
      // 揭阳市,普宁市,116.165690,23.297360
      // 揭阳市,惠来县,116.295110,23.033210
      // 揭阳市,揭西县,115.841890,23.431410
      '云浮市':[112.044530,22.915250]
      // 云浮市,云城区,112.043730,22.927970
      // 云浮市,云安区,112.003240,23.071010
      // 云浮市,罗定市,111.570040,22.768300
      // 云浮市,新兴县,112.225360,22.695730
      // '郁南县':[111.535360,23.234640]
    }

    var data = [{
      name: '广州市',
      value: 199
    },
      {
        name: '深圳市',
        value:112
      },
      {
        name: '佛山市',
        value: 112
      },
      {
        name: '东莞市',
        value: 198
      },
      {
        name: '中山市',
        value: 120
      },
      {
        name: '珠海市',
        value: 116
      },
      {
        name: '江门市',
        value: 120
      },
      {
        name: '肇庆市',
        value: 130
      },
      {
        name: '惠州市',
        value: 128
      },
      {
        name: '汕头市',
        value: 129
      },
      {
        name: '潮州',
        value: 120
      },
      {
        name: '揭阳市',
        value: 158
      },
      {
        name: '汕尾市',
        value: 121
      },
      {
        name: '湛江市',
        value: 123
      },
      {
        name: '茂名市',
        value: 110
      },
      {
        name: '阳江市',
        value: 11
      },
      {
        name: '韶关市',
        value: 198
      },
      {
        name: '清远市',
        value: 116
      },
      {
        name: '云浮市',
        value: 114
      },
      {
        name: '梅州市',
        value: 117
      },
      {
        name: '河源市',
        value: 120
      }
    ];
    var max = 480,
      min = 9; // todo
    var maxSize4Pin = 100,
      minSize4Pin = 20;

    var convertData = function (data) {
      var res = [];
      for (var i = 0; i < data.length; i++) {
        var geoCoord = geoCoordMap[data[i].name];
        if (geoCoord) {
          res.push({
            name: data[i].name,
            value: geoCoord.concat(data[i].value)
          });
        }
      }
      return res;
    };


    option = {
      backgroundColor: 'transparent',
      geo: {
        show: true,
        map: 'xiangxi',
        label: {
          normal: {
            show: false
          },
          emphasis: {
            show: false,
          }
        },
        roam: true,
        itemStyle: {
          normal: {
            //区域背景颜色
            areaColor: '#031525',
            //区域边框颜色
            borderColor: '#7ce0e3',
            borderWidth:1.2,
          },
          emphasis: {
            //鼠标放置区域背景颜色
            areaColor: '#2B91B7',
          }
        }
      },
      series: [
        {
          name: 'pm2.5',
          type: 'scatter',
          coordinateSystem: 'geo',
          data: convertData(data),
          symbolSize: function(val) {
            return val[2] / 10;
          },
          label: {
            normal: {
              formatter: '{b}',
              position: 'right',
              show: false
            },
            emphasis: {
              show: true
            }
          },
          itemStyle: {
            normal: {
              color: '#74cfd2'
            }
          }
        },
        {
          name: 'Top 5',
          type: 'effectScatter',
          coordinateSystem: 'geo',
          data: convertData(data.sort(function(a, b) {
            return b.value - a.value;
          }).slice(0, 3)),
          symbolSize: function(val) {
            return val[2] / 10;
          },
          showEffectOn: 'render',
          rippleEffect: {
            brushType: 'fill'
          },
          hoverAnimation: true,
          label: {
            normal: {
              formatter: '{b}',
              position: 'right',
              show: true
            }
          },
          itemStyle: {
            normal: {
              color: '#74cfd2',
              shadowBlur: 10,
              shadowColor: '#74cfd2'
            }
          },
          zlevel: 1
        }

      ]
    };
    myChart.setOption(option);
  })
});